#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.external.rabbit_01_psp_token_otp: Reading...
random_password.webserver_password: Refreshing state... [id=none]
random_password.alicloud3_password: Refreshing state... [id=none]
random_password.rtmp_password: Refreshing state... [id=none]
tls_private_key.webserver_key: Refreshing state... [id=81d28d3c476734c1aaf4c71b34dcb2860024d06e]
random_password.alicloud_password: Refreshing state... [id=none]
tls_private_key.alicloud3_key: Refreshing state... [id=f63af23191753064cf32785a897bf9b0e4143c8a]
tls_private_key.rtmp_key: Refreshing state... [id=dd53b14179e8a4c84f7cad1fa6972b0b89075bec]
tls_private_key.alicloud_key: Refreshing state... [id=2715b21a5b35894000d79cf7965b18307e9258b3]
data.onepassword_item.rabbit_01_psp_token: Reading...
data.onepassword_item.rabbit_01_psp_token: Read complete after 0s [id=vaults/66qfxcmgwlhutunx6slav6fyve/items/h7fhsftvpum7r4b3rnqznz4lym]
local_file.alicloud3_key_file: Refreshing state... [id=9cb4b53c3420c0fc6eb951fe0ec7cbe716a41334]
local_file.webserver_key_file: Refreshing state... [id=75b14ce05c6a838c5d7461fdb112b503bb8e9dc6]
data.external.rabbit_01_psp_token_otp: Read complete after 1s [id=-]
local_file.rtmp_key_file: Refreshing state... [id=34994146c8d028ca24774dd81d754c8a915cab89]
local_file.alicloud_key_file: Refreshing state... [id=e71958442d331fe590a11c211113b6bc0c601a0f]
proxmox_virtual_environment_file.cloud_config: Refreshing state... [id=local:snippets/ubuntu.cloud-config.yaml]
proxmox_virtual_environment_file.ubuntu2204_cloud_image: Refreshing state... [id=local:iso/jammy-server-cloudimg-amd64.img]
proxmox_virtual_environment_file.ubuntu2004_cloud_image: Refreshing state... [id=local:iso/focal-server-cloudimg-amd64.img]
proxmox_virtual_environment_file.cloud_config_alicloud3: Refreshing state... [id=local:snippets/alicloud3.cloud-config.yaml]
proxmox_virtual_environment_file.alilinux3_cloud_image: Refreshing state... [id=local:iso/aliyun_3_x64_20G_nocloud_alibase_20220907.img]
proxmox_virtual_environment_file.alilinux_cloud_image: Refreshing state... [id=local:iso/aliyun_2_1903_x64_20G_nocloud_alibase_20220525.img]
proxmox_virtual_environment_file.debian_cloud_image: Refreshing state... [id=local:iso/debian-11-genericcloud-amd64.img]
proxmox_virtual_environment_file.cloud_config_rtmp: Refreshing state... [id=local:snippets/ubuntu-rtmp.cloud-config.yaml]
proxmox_virtual_environment_file.cloud_config_alicloud: Refreshing state... [id=local:snippets/alicloud.cloud-config.yaml]
proxmox_virtual_environment_vm.webserver[1]: Refreshing state... [id=502]
proxmox_virtual_environment_vm.webserver[0]: Refreshing state... [id=501]
proxmox_virtual_environment_vm.alicloud3[0]: Refreshing state... [id=801]
proxmox_virtual_environment_vm.rtmp[0]: Refreshing state... [id=601]
proxmox_virtual_environment_vm.alicloud[0]: Refreshing state... [id=701]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # local_file.alicloud3_key_file will be created
  + resource "local_file" "alicloud3_key_file" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "600"
      + filename             = "./alicloud3-ssh.key"
      + id                   = (known after apply)
    }

  # local_file.alicloud_key_file will be created
  + resource "local_file" "alicloud_key_file" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "600"
      + filename             = "./alicloud-ssh.key"
      + id                   = (known after apply)
    }

  # local_file.rtmp_key_file will be created
  + resource "local_file" "rtmp_key_file" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "600"
      + filename             = "./rtmp-ssh.key"
      + id                   = (known after apply)
    }

  # local_file.webserver_key_file will be created
  + resource "local_file" "webserver_key_file" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "600"
      + filename             = "./webserver-ssh.key"
      + id                   = (known after apply)
    }

  # proxmox_virtual_environment_vm.alicloud[0] will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "alicloud" {
        id                      = "701"
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
        name                    = "alicloud1.ddlns.net"
      ~ network_interface_names = [] -> (known after apply)
      ~ tags                    = [
          - "alicloud1",
            "automation",
            "ubuntu",
          + "alicloud1",
        ]
        # (18 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.alicloud3[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "proxmox_virtual_environment_vm" "alicloud3" {
      - acpi                    = true -> null
      - bios                    = "seabios" -> null
      - description             = "alicloud31 Server" -> null
      - id                      = "801" -> null
      - ipv4_addresses          = [] -> null
      - ipv6_addresses          = [] -> null
      - keyboard_layout         = "en-us" -> null
      - mac_addresses           = [
          - "AA:B9:F5:AE:EE:F9",
        ] -> null
      - name                    = "alicloud31.ddlns.net" -> null
      - network_interface_names = [] -> null
      - node_name               = "rabbit-01-psp" -> null
      - on_boot                 = true -> null
      - reboot                  = false -> null
      - started                 = true -> null
      - tablet_device           = true -> null
      - tags                    = [
          - "alicloud31",
          - "automation",
          - "ubuntu",
        ] -> null
      - template                = false -> null
      - timeout_clone           = 1800 -> null
      - timeout_move_disk       = 1800 -> null
      - timeout_reboot          = 1800 -> null
      - timeout_shutdown_vm     = 1800 -> null
      - timeout_start_vm        = 1800 -> null
      - timeout_stop_vm         = 300 -> null
      - vm_id                   = 801 -> null

      - agent {
          - enabled = false -> null
          - timeout = "15m" -> null
          - trim    = false -> null
          - type    = "virtio" -> null
        }

      - cpu {
          - architecture = "x86_64" -> null
          - cores        = 4 -> null
          - flags        = [] -> null
          - hotplugged   = 0 -> null
          - sockets      = 1 -> null
          - type         = "qemu64" -> null
          - units        = 1024 -> null
        }

      - disk {
          - datastore_id = "data-ssd" -> null
          - file_format  = "qcow2" -> null
          - file_id      = "local:iso/aliyun_3_x64_20G_nocloud_alibase_20220907.img" -> null
          - interface    = "virtio0" -> null
          - iothread     = true -> null
          - size         = 30 -> null
          - ssd          = false -> null
        }

      - initialization {
          - datastore_id      = "data-ssd" -> null
          - user_data_file_id = "local:snippets/alicloud3.cloud-config.yaml" -> null

          - ip_config {
              - ipv4 {
                  - address = "dhcp" -> null
                }
            }

          - user_account {
              - keys     = [
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC1Pjk1rQmjCP7aG2wAzEEUxaYzZk5FfapMk607m4GVUZQbAavMYuZiJcDRJSHr+vsHO+wuCpuprcs8BTu2EGJ5j7CCsirwPg/17LggNk5RscvlK4ZjZrQTUQN5X1zEqozammn7Z9QFTAkEpgTPcvwZvI4Kq33H4hTrVXbM1k3Q+HkYnOnz9+J1uwB9yI0Tgm+Y46d9COeb5N2qfqtnpn4tUCtlqtCa8wHUrZy1dbOc7hr3Aqe26eKaMtYEoSsHkRp/i3YU3AG0RuwMLG+22OUeYW/TaKJ2YjYCBXpoLbXvytoh/9YWJfmSh3SKzMmzwky7b+mCZYrayCQNfBYt2hPL",
                ] -> null
              - password = (sensitive value) -> null
              - username = "alinux" -> null
            }
        }

      - memory {
          - dedicated = 4096 -> null
          - floating  = 0 -> null
          - shared    = 0 -> null
        }

      - network_device {
          - bridge      = "vmbr1" -> null
          - enabled     = true -> null
          - mac_address = "AA:B9:F5:AE:EE:F9" -> null
          - model       = "virtio" -> null
          - mtu         = 0 -> null
          - rate_limit  = 0 -> null
          - vlan_id     = 0 -> null
        }

      - operating_system {
          - type = "l26" -> null
        }

      - serial_device {
          - device = "socket" -> null
        }
    }

  # proxmox_virtual_environment_vm.rtmp[0] will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "rtmp" {
        id                      = "601"
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
            ],
          - [
              - "10.10.20.20",
            ],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [
              - "fe80::60f1:59ff:fe86:4ecc",
            ],
        ] -> (known after apply)
        name                    = "rtmp1.ddlns.net"
      ~ network_interface_names = [
          - "lo",
          - "eth0",
        ] -> (known after apply)
      ~ tags                    = [
            "automation",
          - "rtmp1",
            "ubuntu",
          + "rtmp1",
        ]
        # (18 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.webserver[0] will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "webserver" {
        id                      = "501"
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
            ],
          - [
              - "10.10.20.129",
            ],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [
              - "fe80::d823:cff:fec5:9eb5",
            ],
        ] -> (known after apply)
        name                    = "web1.ddlns.net"
      ~ network_interface_names = [
          - "lo",
          - "eth0",
        ] -> (known after apply)
        tags                    = [
            "automation",
            "ubuntu",
            "web1",
        ]
        # (18 unchanged attributes hidden)

        # (9 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.webserver[1] is tainted, so must be replaced
-/+ resource "proxmox_virtual_environment_vm" "webserver" {
      ~ id                      = "502" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "5E:13:2F:73:44:A7",
        ] -> (known after apply)
        name                    = "web2.ddlns.net"
      ~ network_interface_names = [] -> (known after apply)
      ~ started                 = false -> true
        tags                    = [
            "automation",
            "ubuntu",
            "web2",
        ]
        # (16 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
            # (6 unchanged attributes hidden)
        }

      ~ disk {
          + file_id      = "local:iso/jammy-server-cloudimg-amd64.img"
          ~ interface    = "virtio1" -> "virtio0"
          ~ size         = 30 -> 10
            # (4 unchanged attributes hidden)
        }
      + disk {
          + datastore_id = "data-ssd"
          + file_format  = "qcow2"
          + interface    = "virtio1"
          + iothread     = true
          + size         = 30
          + ssd          = false
        }

      ~ initialization {
            # (2 unchanged attributes hidden)

          ~ user_account {
              ~ password = (sensitive value)
                # (2 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }

      ~ network_device {
          - mac_address = "5E:13:2F:73:44:A7" -> null
            # (6 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

Plan: 5 to add, 3 to change, 2 to destroy.

Changes to Outputs:
  ~ rtmp_ip               = [
      - "10.10.20.20",
    ] -> (known after apply)
  ~ webserver_ip          = [
      - "10.10.20.129",
    ] -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @dark-vex, Action: `pull_request`, Working Directory: ``, Workflow: `TF Plan on a PR (PSP)`*